spec/fixtures/express_checkout/checkout/checkout/sales/success.yml

--- 
http_interactions: 
- request: 
    method: post
    uri: https://api-3t.sandbox.paypal.com/nvp
    body: 
      encoding: US-ASCII
      string: USER=chardy_api1.gmail.com&PWD=8DTSWBZC7GDR3T4X&SIGNATURE=AG-8mOpuFhFyFOYHlaTUYn3Syf15AWJKRnfHMVsmCtC3DK51-ENEPqLS&VERSION=93.0&RETURNURL=http%3A%2F%2Fexample.com%2Fthank_you&CANCELURL=http%3A%2F%2Fexample.com%2Fcanceled&PAYMENTREQUEST_0_DESC=Awesome+Shop&PAYMENTREQUEST_0_PAYMENTACTION=Sale&PAYMENTREQUEST_0_AMT=20.00&PAYMENTREQUEST_0_CURRENCYCODE=USD&method=SetExpressCheckout
    headers: 
      User-Agent: 
      - PayPal::Payment/0.1
  response: 
    status: 
      code: 200
      message: OK
    headers: 
      Date: 
      - Thu, 18 Apr 2013 04:57:21 GMT
      Server: 
      - Apache
      Content-Length: 
      - "136"
      Connection: 
      - close
      Content-Type: 
      - text/plain; charset=utf-8
    body: 
      encoding: ASCII-8BIT
      string: TOKEN=EC%2d12X82860F72356252&TIMESTAMP=2013%2d04%2d18T04%3a57%3a21Z&CORRELATIONID=78089dac101fe&ACK=Success&VERSION=93%2e0&BUILD=5691908
    http_version: 
  recorded_at: Thu, 18 Apr 2013 04:57:21 GMT
- request: 
    method: post
    uri: https://api-3t.sandbox.paypal.com/nvp
    body: 
      encoding: US-ASCII
      string: USER=chardy_api1.gmail.com&PWD=8DTSWBZC7GDR3T4X&SIGNATURE=AG-8mOpuFhFyFOYHlaTUYn3Syf15AWJKRnfHMVsmCtC3DK51-ENEPqLS&VERSION=93.0&RETURNURL=http%3A%2F%2Fexample.com%2Fthank_you&CANCELURL=http%3A%2F%2Fexample.com%2Fcanceled&PAYMENTREQUEST_0_DESC=Awesome+Shop&PAYMENTREQUEST_0_PAYMENTACTION=Sale&PAYMENTREQUEST_0_AMT=20.00&PAYMENTREQUEST_0_CURRENCYCODE=USD&method=SetExpressCheckout
    headers: 
      User-Agent: 
      - PayPal::Payment/0.1
  response: 
    status: 
      code: 200
      message: OK
    headers: 
      Date: 
      - Thu, 18 Apr 2013 04:57:22 GMT
      Server: 
      - Apache
      Content-Length: 
      - "136"
      Connection: 
      - close
      Content-Type: 
      - text/plain; charset=utf-8
    body: 
      encoding: ASCII-8BIT
      string: TOKEN=EC%2d4NT45905PP4254419&TIMESTAMP=2013%2d04%2d18T04%3a57%3a22Z&CORRELATIONID=4590c8a1291ab&ACK=Success&VERSION=93%2e0&BUILD=5691908
    http_version: 
  recorded_at: Thu, 18 Apr 2013 04:57:22 GMT
recorded_with: VCR 2.3.0
