spec/fixtures/express_checkout/checkout/checkout/success.yml

--- 
http_interactions: 
- request: 
    method: post
    uri: https://api-3t.sandbox.paypal.com/nvp
    body: 
      encoding: US-ASCII
      string: USER=chardy_api1.gmail.com&PWD=8DTSWBZC7GDR3T4X&SIGNATURE=AG-8mOpuFhFyFOYHlaTUYn3Syf15AWJKRnfHMVsmCtC3DK51-ENEPqLS&VERSION=72.0&RETURNURL=http%3A%2F%2Fexample.com%2Fthank_you&CANCELURL=http%3A%2F%2Fexample.com%2Fcanceled&PAYMENTREQUEST_0_DESC=Awesome+-+Monthly+Subscription&PAYMENTREQUEST_0_NOTIFYURL=http%3A%2F%2Fexample.com%2Fpaypal%2Fipn&PAYMENTREQUEST_0_PAYMENTACTION=Authorization&PAYMENTREQUEST_0_AMT=9.00&PAYMENTREQUEST_0_CURRENCYCODE=USD&L_BILLINGTYPE0=RecurringPayments&L_BILLINGAGREEMENTDESCRIPTION0=Awesome+-+Monthly+Subscription&method=SetExpressCheckout
    headers: 
      User-Agent: 
      - PayPal::Payment/0.1
  response: 
    status: 
      code: 200
      message: OK
    headers: 
      Date: 
      - Sun, 17 Mar 2013 17:44:43 GMT
      Server: 
      - Apache
      Content-Length: 
      - "136"
      Connection: 
      - close
      Content-Type: 
      - text/plain; charset=utf-8
    body: 
      encoding: ASCII-8BIT
      string: TOKEN=EC%2d2EV77664BK856305S&TIMESTAMP=2013%2d03%2d17T17%3a44%3a45Z&CORRELATIONID=97beb387d247d&ACK=Success&VERSION=72%2e0&BUILD=5451042
    http_version: 
  recorded_at: Sun, 17 Mar 2013 17:44:45 GMT
recorded_with: VCR 2.3.0
